//Задача 4: Напишите программу, которая принимает на вход три числа и выдаёт максимальное из этих чисел.

System.Console.WriteLine("Введите три числа");
int numb1 = Convert.ToInt32(Console.ReadLine());
int numb2 = Convert.ToInt32(Console.ReadLine());
int numb2 = Convert.ToInt32(Console.ReadLine());
if (numb1 > numb2) 
{
    System.Console.WriteLine("Первое больше второго");
}
else 
{
    System.Console.WriteLine("Первое число меньше второго");
}